In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Pandas 
   - Python Library
   - Pandas deals in al types of data
   - Backend Numpy
# Pandas Data Structure
   - Pandas Series
   - Pandas Data Frame

# Pandas Series
     - Data in single columns (Univariate) is Series.

In [9]:
# Creating Series 
s1  = pd.Series([23,45,67.0,89,34])
s1

0    23.0
1    45.0
2    67.0
3    89.0
4    34.0
dtype: float64

components:  index , values , dtype

In [6]:
s1.values

array([23, 45, 67, 89, 34], dtype=int64)

In [7]:
s1.index

RangeIndex(start=0, stop=5, step=1)

In [8]:
s1.dtype

dtype('int64')

In [10]:
s2 = pd.Series(['Headphone', 'Laptop', 'MobilePhone', 'Python', 'Powerbank'])
s2

0      Headphone
1         Laptop
2    MobilePhone
3         Python
4      Powerbank
dtype: object

# Indexing

In [11]:
s2[3]

'Python'

In [13]:
s2[0]

'Headphone'

# Slicing

In [14]:
s2[1:4]

1         Laptop
2    MobilePhone
3         Python
dtype: object

Lables: index are default sequences(0,1,2,.....) where as lables are the index provided by us.

In [20]:
fruits = pd.Series(data=[12,24,36,12,18,12,24],index=['Apples','Mangoes','Bananas','Peeches','Cherries','Gauvas','Oranges'])
fruits

Apples      12
Mangoes     24
Bananas     36
Peeches     12
Cherries    18
Gauvas      12
Oranges     24
dtype: int64

In [23]:
fruits['Bananas']

36

In [24]:
fruits['Apples']

12

In [25]:
fruits['Mangoes':'Gauvas']

Mangoes     24
Bananas     36
Peeches     12
Cherries    18
Gauvas      12
dtype: int64

In [26]:
fruits[::2]

Apples      12
Bananas     36
Cherries    18
Oranges     24
dtype: int64

In [27]:
# returns boolean series
fruits == 12

Apples       True
Mangoes     False
Bananas     False
Peeches      True
Cherries    False
Gauvas       True
Oranges     False
dtype: bool

# Boolean Indexing: data is choosen on the basis of boolean True

In [30]:
fruits

Apples      12
Mangoes     24
Bananas     36
Peeches     12
Cherries    18
Gauvas      12
Oranges     24
dtype: int64

In [28]:
# boolean array or List
abc  = [True, False, False ,True, True, True, False]

In [29]:
fruits[abc]

Apples      12
Peeches     12
Cherries    18
Gauvas      12
dtype: int64

In [31]:
fruits[fruits==12]

Apples     12
Peeches    12
Gauvas     12
dtype: int64

In [32]:
fruits[fruits>12]

Mangoes     24
Bananas     36
Cherries    18
Oranges     24
dtype: int64

In [34]:
fruits[ (fruits>12) & (fruits<24) ]

Cherries    18
dtype: int64

In [35]:
fruits[ (fruits==12) | (fruits>24) ]

Apples     12
Bananas    36
Peeches    12
Gauvas     12
dtype: int64

In [36]:
fruits.shape

(7,)

In [37]:
fruits.size

7

In [39]:
fruits.ndim

1

# Pandas DataFrame
   - Data in more than 1 columns is dataframe

In [40]:
result = {'roll#':[1,2,3,4,5,6,7,8,9,10],
         'name':['Asad','Ali','Basir','Atif', 'Fahad','Aslam', 'Babar','Tahir','Tariq','Umer'],
         'python':[78,67,89,45,34,78,90,99,34,50],
         'numpy': [78,89,90,89,78,76,76,75,78,67],
         'pandas':[88,87,86,67,45,62,90,97,98,100]}

In [63]:
result = pd.DataFrame(result)
result

   roll#   name  python  numpy  pandas
0      1   Asad      78     78      88
1      2    Ali      67     89      87
2      3  Basir      89     90      86
3      4   Atif      45     89      67
4      5  Fahad      34     78      45
5      6  Aslam      78     76      62
6      7  Babar      90     76      90
7      8  Tahir      99     75      97
8      9  Tariq      34     78      98
9     10   Umer      50     67     100

In [51]:
emp =  pd.read_excel("employee.xlsx")
emp

    Serial  Emp_ID Designation  Department   Age    Salary
0        1    1101     Manager    Accounts  50.0  200000.0
1        2    1107     Officer          IT  30.0   80000.0
2        3    1203     Officer          HR  28.0       NaN
3        4    1005     Manager          HR  45.0  120000.0
4        5    2123  Office Boy    Accounts  27.0   45000.0
5        6    2451  Accountant         NaN  34.0  100000.0
6        7    1111  Accountant    Accounts   NaN  110000.0
7        8    1001     Officer          IT  25.0   75000.0
8        9    1234     Manager          IT  23.0       NaN
9       10    2156    Engineer  Production  45.0   89000.0
10      11    6543     Officer  Production  29.0  100000.0
11      12    3214  Accountant     Account  49.0  123000.0
12      13    2156    Engineer  Production  45.0   89000.0
13      14    1098     Officer          IT  25.0  100000.0
14      15    2912     Officer          IT  31.0   90000.0
15      16    1222     Officer         NaN  25.0       NaN
16      17    2156    Engineer  Production  45.0   89000.0
17      18    2123  Office Boy    Accounts  27.0   45000.0

# Result Data`

# Columns
    - Accessing a col
    - Accessing more than 1 col
    - del a col 
    - add a col

In [67]:
result

   roll#   name  python  numpy  pandas
0      1   Asad      78     78      88
1      2    Ali      67     89      87
2      3  Basir      89     90      86
3      4   Atif      45     89      67
4      5  Fahad      34     78      45
5      6  Aslam      78     76      62
6      7  Babar      90     76      90
7      8  Tahir      99     75      97
8      9  Tariq      34     78      98
9     10   Umer      50     67     100

# Accessing a col

In [ ]:
result['name']

In [ ]:
result.pandas

In [ ]:
result.python

# Accessing more than a col

In [69]:
result[['name','python']]

    name  python
0   Asad      78
1    Ali      67
2  Basir      89
3   Atif      45
4  Fahad      34
5  Aslam      78
6  Babar      90
7  Tahir      99
8  Tariq      34
9   Umer      50

In [70]:
result[['name','numpy','python']]

    name  numpy  python
0   Asad     78      78
1    Ali     89      67
2  Basir     90      89
3   Atif     89      45
4  Fahad     78      34
5  Aslam     76      78
6  Babar     76      90
7  Tahir     75      99
8  Tariq     78      34
9   Umer     67      50

# Adding more columns in data 
     - Broadcasting a value to all records
     - Generate data from data
           - conditional

In [71]:
result

   roll#   name  python  numpy  pandas
0      1   Asad      78     78      88
1      2    Ali      67     89      87
2      3  Basir      89     90      86
3      4   Atif      45     89      67
4      5  Fahad      34     78      45
5      6  Aslam      78     76      62
6      7  Babar      90     76      90
7      8  Tahir      99     75      97
8      9  Tariq      34     78      98
9     10   Umer      50     67     100

In [72]:
result['total'] = result.python + result.pandas + result.numpy
result

   roll#   name  python  numpy  pandas  total
0      1   Asad      78     78      88    244
1      2    Ali      67     89      87    243
2      3  Basir      89     90      86    265
3      4   Atif      45     89      67    201
4      5  Fahad      34     78      45    157
5      6  Aslam      78     76      62    216
6      7  Babar      90     76      90    256
7      8  Tahir      99     75      97    271
8      9  Tariq      34     78      98    210
9     10   Umer      50     67     100    217

In [73]:
result['status']=["Pass" if mark>=225 else "Fail"  for mark in  result.total]
result

   roll#   name  python  numpy  pandas  total status
0      1   Asad      78     78      88    244   Pass
1      2    Ali      67     89      87    243   Pass
2      3  Basir      89     90      86    265   Pass
3      4   Atif      45     89      67    201   Fail
4      5  Fahad      34     78      45    157   Fail
5      6  Aslam      78     76      62    216   Fail
6      7  Babar      90     76      90    256   Pass
7      8  Tahir      99     75      97    271   Pass
8      9  Tariq      34     78      98    210   Fail
9     10   Umer      50     67     100    217   Fail